#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # kubernetes_service.svc_kube_elastic_search will be created
+ resource "kubernetes_service" "svc_kube_elastic_search" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "service" = "elasticsearch"
            }
          + name             = "es-nodes"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "service" = "elasticsearch"
            }
          + session_affinity            = "None"
          + type                        = "NodePort"

          + port {
              + name        = "external"
              + node_port   = (known after apply)
              + port        = 9200
              + protocol    = "TCP"
              + target_port = "9200"
            }
          + port {
              + name        = "internal"
              + node_port   = (known after apply)
              + port        = 9300
              + protocol    = "TCP"
              + target_port = "9300"
            }
        }
    }

  # kubernetes_stateful_set.sfs_kube_elastic_search will be created
+ resource "kubernetes_stateful_set" "sfs_kube_elastic_search" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "service" = "elasticsearch"
            }
          + name             = "elasticsearch"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + pod_management_policy  = (known after apply)
          + replicas               = 2
          + revision_history_limit = (known after apply)
          + service_name           = "es-nodes"

          + selector {
              + match_labels = {
                  + "service" = "elasticsearch"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "service" = "elasticsearch"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + dns_policy                       = "ClusterFirst"
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 300

                  + container {
                      + image                    = "docker.elastic.co/elasticsearch/elasticsearch:6.4.3"
                      + image_pull_policy        = (known after apply)
                      + name                     = "elasticsearch"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + env {
                          + name  = "cluster.name"
                          + value = "elasticsearch-cluster"
                        }
                      + env {
                          + name = "node.name"

                          + value_from {

                              + field_ref {
                                  + api_version = "v1"
                                  + field_path  = "metadata.name"
                                }
                            }
                        }
                      + env {
                          + name  = "discovery.zen.ping.unicast.hosts"
                          + value = "elasticsearch-0.es-nodes.default.svc.cluster.local,elasticsearch-1.es-nodes.default.svc.cluster.local,elasticsearch-2.es-nodes.default.svc.cluster.local"
                        }
                      + env {
                          + name  = "ES_JAVA_OPTS"
                          + value = "-Xms512m -Xmx512m"
                        }

                      + port {
                          + container_port = 9200
                          + name           = "http"
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 9300
                          + name           = "tcp"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = "1Gi"
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = "400Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path = "/usr/share/elasticsearch/data"
                          + name       = "data"
                          + read_only  = false
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + init_container {
                      + command                  = [
                          + "sh",
                          + "-c",
                          + "ulimit",
                          + "-n",
                          + "65536",
                        ]
                      + image                    = "busybox"
                      + image_pull_policy        = (known after apply)
                      + name                     = "ulimit"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = true
                          + read_only_root_filesystem  = false
                        }

                      + volume_mount {
                          + mount_path = (known after apply)
                          + name       = (known after apply)
                          + read_only  = (known after apply)
                          + sub_path   = (known after apply)
                        }
                    }
                  + init_container {
                      + command                  = [
                          + "sysctl",
                          + "-w",
                          + "vm.max_map_count=262144",
                        ]
                      + image                    = "busybox"
                      + image_pull_policy        = (known after apply)
                      + name                     = "vm-max-map-count"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = true
                          + read_only_root_filesystem  = false
                        }

                      + volume_mount {
                          + mount_path = (known after apply)
                          + name       = (known after apply)
                          + read_only  = (known after apply)
                          + sub_path   = (known after apply)
                        }
                    }
                  + init_container {
                      + command                  = [
                          + "chown",
                          + "-R",
                          + "1000:1000",
                          + "/usr/share/elasticsearch/data",
                        ]
                      + image                    = "busybox"
                      + image_pull_policy        = (known after apply)
                      + name                     = "volume-permission"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = true
                          + read_only_root_filesystem  = false
                        }

                      + volume_mount {
                          + mount_path = "/usr/share/elasticsearch/data"
                          + name       = "data"
                          + read_only  = false
                        }
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }

          + volume_claim_template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = "data"
                  + namespace        = "default"
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + access_modes       = [
                      + "ReadWriteOnce",
                    ]
                  + storage_class_name = "standard"
                  + volume_name        = (known after apply)

                  + resources {
                      + requests = {
                          + "storage" = "5Gi"
                        }
                    }
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Plan`, Action: `hashicorpterraform-github-actions4`*